Repository: Technical-Publications-Bombardier/BaXmlSplitter
Catalog: MauiXmlSplitter/Resources/AppResources.*.resx
Languages: fr

source: About
fr: À propos

source: An I/O error occurred while creating a directory at '{OutputDirectory}'
fr: Une erreur d'E/S s'est produite lors de la création d'un répertoire à '{OutputDirectory}'

# AppDescription
source: Work-in-progress exporting tool: An XML splitting application for segmenting the Bombardier flight and maintenance manuals into in-progress units of work.
fr: Outil d'exportation des travaux en cours : une application de fractionnement XML pour segmenter les manuels de vol et de maintenance de Bombardier en unités de travail en cours.

# AppName
source: Bombardier Work-in-Progress XML Splitter
fr: Séparatrice XML de Bombardier en cours de réalisation

source: App Version
fr: Version de l'appli

source: Attempted split not ready: output directory not provided
fr: Tentative de fractionnement non prête : répertoire de sortie non fourni

source: Attempted split not ready: program not provided
fr: Tentative de scission non prête : programme non fourni

source: Attempted split not ready: unit-of-work states not provided
fr: Tentative de fractionnement non prête : états des unités de travail non fournis

source: Attempted split not ready: XML not provided
fr: Tentative de fractionnement non prête : XML non fourni

source: Authors
fr: Auteurs

source: Browse
fr: Parcourir

source: Cancel
fr: Annuler

source: Cancelled XML Selection
fr: Sélection XML annulée

source: Checkout items are null
fr: Les articles à la caisse sont nuls

source: Choose Output Directory
fr: Choisissez le répertoire de sortie

source: Clear Console
fr: Effacer la console

source: Client Secret
fr: Secret client

source: Closest manual found for {Program} {Manual} is {ClosestManual}
fr: Le manuel le plus proche trouvé pour {Programme} {Manuel} est {Manuel le plus proche}

source: Could not load static resources
fr: Impossible de charger les ressources statiques

# CouldNotParseUOWStatesFile
source: Could not parse units-of-work states file
fr: Impossible d'analyser le fichier des états des unités de travail

source: Could not read docnbr from UOW states file
fr: Impossible de lire le docnbr à partir du fichier d'états unités de travail

source: Could not read docnbr from XML
fr: Impossible de lire le document à partir de XML

source: Created output directory: '{OutputDirectory}'
fr: Répertoire de sortie créé : '{OutputDirectory}'

source: Creating output directory: '{OutputDirectory}'
fr: Création du répertoire de sortie : '{OutputDirectory}'

# CsdbProgramInferred
source: CSDB Program succesfully identified from XML docnbr
fr: Le programme CSDB a été identifié avec succès à partir du docnbr de XML

source: Deserialized CheckoutItems with {NumItems} items
fr: CheckoutItems désérialisés avec {NumItems} éléments

source: Deserialized DocnbrManualFromProgram with {NumItems} items
fr: Numéro de document et manuel du programme désérialisé avec des éléments {NumItems}

source: Deserialized LookupEntities with {NumItems} items
fr: LookupEntities désérialisées avec {NumItems} éléments

source: Deserialized ProgramPerDocnbr with {NumItems} items
fr: ProgramPerDocnbr désérialisé avec {NumItems} éléments

source: Deserialized StatesPerProgram with {NumItems} items
fr: StatesPerProgram désérialisé avec {NumItems} éléments

# DoesNotAppearToProvideValidUOWStates
source: Does not appear to provide valid unit-of-work states
fr: ne semble pas fournir des états unités de travail valides

source: English
fr: Anglais

source: Error initializing
fr: Erreur lors de l'initialisation

source: Error loading XML
fr: Erreur de chargement de XML

source: Execute Split
fr: Exécuter le fractionnement

source: Failed to load XML: '{message}'
fr: Échec du chargement du XML : '{message}'

source: File appears not to be plaintext
fr: Le fichier ne semble pas être en texte brut

source: File did not meet expected pattern
fr: Le fichier ne correspond pas au modèle attendu

source: File was empty or too short
fr: Le fichier était vide ou trop court

source: Found {num} units of work in the manual
fr: {num} unités de travail trouvées dans le manuel

source: French
fr: Français

# GraphicAlt
source: An isometric graphic representation of the XML splitting process
fr: Une représentation graphique isométrique du processus de fractionnement XML

source: Initialization was cancelled
fr: L'initialisation a été annulée

source: Initialized XmlSplitterViewModel
fr: XmlSplitterViewModel initialisé

source: Initializing XmlSplitterViewModel
fr: Initialisation de XmlSplitterViewModel

source: Invalid file chosen for units-of-work states
fr: Fichier non valide choisi pour les états d'unités de travail

source: Invalid UOW file '{UowStatesFile}' chosen
fr: Fichier unités de travail non valide '{UowStatesFile}' choisi

source: Invalid UOW file '{UowStatesFile}' chosen: '{message}'
fr: Fichier unités de travail non valide '{UowStatesFile}' choisi : '{message}'

source: Language
fr: Langue

source: Maintenance/Flight Manual
fr: Manuel de maintenance/vol

source: Manual from docnbr is null
fr: Le manuel de docnbr est nul

# MauiProgramCreateMauiApp
source: Created the Application
fr: Création de l'application

# NameofPickUowStatesFileWasCancelled
source: {PickUowStatesFile} was cancelled
fr: {nameof(PickUowStatesFile)} a été annulé

source: No file provided
fr: Aucun fichier fourni

# NoUOWStatesSelected
source: No units-of-work selected
fr: Aucune unité de travail sélectionnée

source: Output Directory
fr: Dossier de sortie

source: Product
fr: Produit

source: Program
fr: Programme

source: Ran into an error while deserializing: '{message}'
fr: J'ai rencontré une erreur lors de la désérialisation : '{message}'

source: Reload
fr: Recharger

source: Required
fr: Requis

source: Save
fr: Sauvegarder

source: Saving fragments cancelled
fr: L'enregistrement des fragments a été annulé

source: Select CSDB Program
fr: Sélectionnez le programme CSDB

source: Select units-of-work to extract by states
fr: Sélectionnez les unités de travail à extraire par états

# SelectUOWFile
source: Select UOW States File
fr: Sélectionnez le fichier d'états UOW

source: Select XML File
fr: Sélectionnez un fichier XML

source: Settings
fr: Paramètres

source: Split Manual
fr: Manuel divisé

source: Splitting XML file {XmlFilePath} into {NumNodes} fragments
fr: Découpage du fichier XML {XmlFilePath} en fragments {NumNodes}

source: States File
fr: Fichier des États

source: Status
fr: Statut

source: The directory path format '{OutputDirectory}' is not supported
fr: Le format de chemin d'accès '{OutputDirectory}' n'est pas pris en charge

source: The directory path '{OutputDirectory}' is invalid
fr: Le chemin d'accès au répertoire '{OutputDirectory}' n'est pas valide

source: The file
fr: Le fichier

source: The XML docnbr '{Docnbr}' does not match the UOW docnbr '{UowStatesDocnbr}'
fr: Le document XML '{Docnbr}' ne correspond pas au document UOW '{UowStatesDocnbr}'

source: The XML had no docnbr attribute
fr: Le XML n'avait pas d'attribut docnbr

source: The XML loading was cancelled
fr: Le chargement XML a été annulé

source: Units-of-Work
fr: Unités de travail

source: UOW not parsed
fr: UOW non analysé

source: Wrote fragment '{name}'
fr: A écrit le fragment '{name}'

source: XML docnbr '{xmlDocnbr}' does not match UOW states file docnbr '{uowDocnbr}'
fr: Le document XML '{xmlDocnbr}' ne correspond pas au docnbr de fichier d'états unités de travail '{uowDocnbr}'

source: XML File
fr: Fichier XML

source: XML load failed with '{message}'
fr: Le chargement XML a échoué avec '{message}'

source: XML nodes were empty: No checkout units to export.
fr: Les nœuds XML étaient vides : aucune unité de paiement à exporter.

source: XmlSplitter
fr: Séparateur XML

source: You do not have permission to create a directory at '{OutputDirectory}'
fr: Vous n'avez pas la permission de créer un répertoire à '{OutputDirectory}'
